a,b = map(int, input().split())
if a>b:
    print(">")
elif a<b:
    print("<")
elif a==b:
    print("==")

#이렇게 map을 사용하면 입력할때 형태를 정할 수 있다. 지금은 정수로 입력한다는 것   
##############################################################################################################
a = int(input())

for n in range(a, 0, -1): # 시작숫자 a, 끝숫자 0+1, 그리고 줄어드는 값 -1
    print(n)

#이렇게 거꾸로 출력이 된다. 또한 밑에처럼 reversed를 쓸수가 있다.
a = int(input())

for n in reversed(range(1,a+1)):
    print(n)
##############################################################################################################
n = int(input())

for i in range(1, n+1):
    print(" "*(n-i)+"*"*i)
#이렇게 간단하게 역으로 별찍기를 파이썬에서는 할 수 있다.
